function solution(letter) {
    const morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    };

    return letter
        .split(' ')           // 공백 기준으로 자르고
        .map(x => morse[x])   // 각각의 모스 코드를 문자로 변환하고
        .join('');            // 다시 문자열로 붙이기
}
